# postgres://hvfunzhl:Rfc9Qacy89gxakiFcEvSyEqi-Mdw5p51@arjuna.db.elephantsql.com/hvfunzhl

In [1]:
import psycopg2

db_params = {

    "port" : "5432",
    "host" : "arjuna.db.elephantsql.com",
    "user" : "hvfunzhl",
    "password" : "Rfc9Qacy89gxakiFcEvSyEqi-Mdw5p51",
    "database": "hvfunzhl"
}

connection = psycopg2.connect(**db_params)

In [2]:
import pandas as pd

In [3]:
orders_query="""select * from orders"""
orders= pd.read_sql_query(orders_query,connection)

C:\Users\saini\AppData\Local\Temp\ipykernel_17688\623368671.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  orders= pd.read_sql_query(orders_query,connection)

In [4]:
orders

,order_id,customer_id,employee_id,order_date,required_date,shipped_date,ship_via,freight,ship_name,ship_address,ship_city,ship_region,ship_postal_code,ship_country
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil
3,10251,VICTE,3,1996-07-08,1996-08-05,1996-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,None,69004,France
4,10252,SUPRD,4,1996-07-09,1996-08-06,1996-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,None,B-6000,Belgium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
825,11073,PERIC,2,1998-05-05,1998-06-02,None,2,24.95,Pericles Comidas clásicas,Calle Dr. Jorge Cash 321,México D.F.,None,05033,Mexico
826,11074,SIMOB,7,1998-05-06,1998-06-03,None,2,18.44,Simons bistro,Vinbæltet 34,Kobenhavn,None,1734,Denmark
827,11075,RICSU,8,1998-05-06,1998-06-03,None,2,6.19,Richter Supermarkt,Starenweg 5,Genève,None,1204,Switzerland
828,11076,BONAP,4,1998-05-06,1998-06-03,None,2,38.28,Bon app',"12, rue des Bouchers",Marseille,None,13008,France
829,11077,RATTC,1,1998-05-06,1998-06-03,None,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA

In [5]:
orders_query="""select * from employees"""
employees = pd.read_sql_query(orders_query,connection)

employees

C:\Users\saini\AppData\Local\Temp\ipykernel_17688\3551960483.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employees = pd.read_sql_query(orders_query,connection)

,employee_id,last_name,first_name,title,title_of_courtesy,birth_date,hire_date,address,city,region,postal_code,country,home_phone,extension,photo,notes,reports_to,photo_path
0,1,Davolio,Nancy,Sales Representative,Ms.,1948-12-08,1992-05-01,507 - 20th Ave. E.\nApt. 2A,Seattle,WA,98122,USA,(206) 555-9857,5467,[],Education includes a BA in psychology from Col...,2.0,http://accweb/emmployees/davolio.bmp
1,2,Fuller,Andrew,"Vice President, Sales",Dr.,1952-02-19,1992-08-14,908 W. Capital Way,Tacoma,WA,98401,USA,(206) 555-9482,3457,[],Andrew received his BTS commercial in 1974 and...,NaN,http://accweb/emmployees/fuller.bmp
2,3,Leverling,Janet,Sales Representative,Ms.,1963-08-30,1992-04-01,722 Moss Bay Blvd.,Kirkland,WA,98033,USA,(206) 555-3412,3355,[],Janet has a BS degree in chemistry from Boston...,2.0,http://accweb/emmployees/leverling.bmp
3,4,Peacock,Margaret,Sales Representative,Mrs.,1937-09-19,1993-05-03,4110 Old Redmond Rd.,Redmond,WA,98052,USA,(206) 555-8122,5176,[],Margaret holds a BA in English literature from...,2.0,http://accweb/emmployees/peacock.bmp
4,5,Buchanan,Steven,Sales Manager,Mr.,1955-03-04,1993-10-17,14 Garrett Hill,London,None,SW1 8JR,UK,(71) 555-4848,3453,[],Steven Buchanan graduated from St. Andrews Uni...,2.0,http://accweb/emmployees/buchanan.bmp
5,6,Suyama,Michael,Sales Representative,Mr.,1963-07-02,1993-10-17,Coventry House\nMiner Rd.,London,None,EC2 7JR,UK,(71) 555-7773,428,[],Michael is a graduate of Sussex University (MA...,5.0,http://accweb/emmployees/davolio.bmp
6,7,King,Robert,Sales Representative,Mr.,1960-05-29,1994-01-02,Edgeham Hollow\nWinchester Way,London,None,RG1 9SP,UK,(71) 555-5598,465,[],Robert King served in the Peace Corps and trav...,5.0,http://accweb/emmployees/davolio.bmp
7,8,Callahan,Laura,Inside Sales Coordinator,Ms.,1958-01-09,1994-03-05,4726 - 11th Ave. N.E.,Seattle,WA,98105,USA,(206) 555-1189,2344,[],Laura received a BA in psychology from the Uni...,2.0,http://accweb/emmployees/davolio.bmp
8,9,Dodsworth,Anne,Sales Representative,Ms.,1966-01-27,1994-11-15,7 Houndstooth Rd.,London,None,WG2 7LT,UK,(71) 555-4444,452,[],Anne has a BA degree in English from St. Lawre...,5.0,http://accweb/emmployees/davolio.bmp

In [6]:
employee_query="""select employee_id,(first_name||''||last_name)as full_name,city,region,country,reports_to from employees"""
employee= pd.read_sql_query(employee_query,connection)

employee

C:\Users\saini\AppData\Local\Temp\ipykernel_17688\3327793617.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employee= pd.read_sql_query(employee_query,connection)

   employee_id        full_name      city region country  reports_to
0            1     NancyDavolio   Seattle     WA     USA         2.0
1            2     AndrewFuller    Tacoma     WA     USA         NaN
2            3   JanetLeverling  Kirkland     WA     USA         2.0
3            4  MargaretPeacock   Redmond     WA     USA         2.0
4            5   StevenBuchanan    London   None      UK         2.0
5            6    MichaelSuyama    London   None      UK         5.0
6            7       RobertKing    London   None      UK         5.0
7            8    LauraCallahan   Seattle     WA     USA         2.0
8            9    AnneDodsworth    London   None      UK         5.0

In [7]:
manager_query="""select employee_id,(first_name||''||last_name)as manager from employees"""
manager = pd.read_sql_query(manager_query,connection)

manager

C:\Users\saini\AppData\Local\Temp\ipykernel_17688\2753086427.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  manager = pd.read_sql_query(manager_query,connection)

   employee_id          manager
0            1     NancyDavolio
1            2     AndrewFuller
2            3   JanetLeverling
3            4  MargaretPeacock
4            5   StevenBuchanan
5            6    MichaelSuyama
6            7       RobertKing
7            8    LauraCallahan
8            9    AnneDodsworth

In [8]:
employee = pd.merge(employee,manager,left_on="reports_to",right_on='employee_id',how='left')

employee

,employee_id_x,full_name,city,region,country,reports_to,employee_id_y,manager
0,1,NancyDavolio,Seattle,WA,USA,2.0,2.0,AndrewFuller
1,2,AndrewFuller,Tacoma,WA,USA,NaN,NaN,NaN
2,3,JanetLeverling,Kirkland,WA,USA,2.0,2.0,AndrewFuller
3,4,MargaretPeacock,Redmond,WA,USA,2.0,2.0,AndrewFuller
4,5,StevenBuchanan,London,None,UK,2.0,2.0,AndrewFuller
5,6,MichaelSuyama,London,None,UK,5.0,5.0,StevenBuchanan
6,7,RobertKing,London,None,UK,5.0,5.0,StevenBuchanan
7,8,LauraCallahan,Seattle,WA,USA,2.0,2.0,AndrewFuller
8,9,AnneDodsworth,London,None,UK,5.0,5.0,StevenBuchanan

In [9]:
from sqlalchemy import create_engine

In [10]:
connection_string = "postgresql://hvfunzhl:Rfc9Qacy89gxakiFcEvSyEqi-Mdw5p51@arjuna.db.elephantsql.com/hvfunzhl"
engine = create_engine(connection_string)

In [11]:
employee.to_sql('employee_temp',engine,if_exists='replace')

9